In [20]:
import pandas as pd
data = pd.read_csv('Mall_Customers.csv')
print(data)

     CustomerID  Gender   Age  Annual_Income (k$)  Spending_Score (1-100)
0             1    Male  19.0                15.0                    39.0
1             2    Male  21.0                 NaN                    81.0
2             3  Female  20.0                16.0                     6.0
3             4  Female  20.0                16.0                     6.0
4             5  Female  31.0                17.0                    40.0
..          ...     ...   ...                 ...                     ...
208         209  Female   NaN               120.0                    79.0
209         210  Female  45.0               126.0                    28.0
210         211    Male  32.0               126.0                    74.0
211         212    Male  32.0               137.0                    18.0
212         213    Male  30.0               137.0                    83.0

[213 rows x 5 columns]

In [21]:
data.isnull()

     CustomerID  Gender    Age  Annual_Income (k$)  Spending_Score (1-100)
0         False   False  False               False                   False
1         False   False  False                True                   False
2         False   False  False               False                   False
3         False   False  False               False                   False
4         False   False  False               False                   False
..          ...     ...    ...                 ...                     ...
208       False   False   True               False                   False
209       False   False  False               False                   False
210       False   False  False               False                   False
211       False   False  False               False                   False
212       False   False  False               False                   False

[213 rows x 5 columns]

In [33]:
df = data.drop_duplicates(subset=["Gender"])
print(df)

     CustomerID  Gender   Age  Annual_Income (k$)  Spending_Score (1-100)
0             1    Male  19.0                15.0                    39.0
2             3  Female  20.0                16.0                     6.0
160         161     NaN  30.0                78.0                    78.0